075

Zadanie A

2. Konfiguracja i w³¹czenie stosownych interfejsów IP ruterów - ró¿ne sieci IP pod³¹czone do 
	ruterów - zgodne z ogólnie znanymi zasadami.

3. 
Router(config)#ip routing
Router(config)#ip classless

4.
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.1  (192.168.1.1 - dowolny interfejs w sieci bezpoœrednio pod³¹czonej)
	//Aktywowanie RIP wersja 1.
Router(config)#router rip 
Router(config-router)#network 200.200.100.0
Router(config-router)#network 200.200.200.0 
	//Bez generalizowania informacji o sieciach do klasy adresu IP:
Router(config-router)#no auto-summary
ping lub traceroute
Router#show ip route
Router#show ip protocols
	//ewentualnie:
Router#debug ip rip
Router#debug ip routing 

5. Aktywowanie RIP wersja 2.
Router(config-router)#version 2
Router(config)#key chain nazwa
Router(config-keychain)#key 2
Router (config-keychain-key)#key-string 0987654321 
Router (config-if)#ip rip authentication key-chain nazwa
Router(config-if)#ip rip authentication mode md5 
	//Sprawdziæ dzia³anie konfiguracji

6. //Chyba opcjonalne:
Router1(config-if)#ip rip send version 2
Router2(config-if)#ip rip receive version 1 

7.
Router(config)#ip route 200.200.200.0 255.255.255.0 200.200.100.5 150
	//200.200.100.5 - inne (alternatywne) wyjœcie z bie¿¹cej sieci
	//150 - metryka odleg³oœci

8. To lepiej jednak przeczytaæ w instrukcji
R1(config-if)#ip summary-address rip 200.200.0.0 255.255.254.0

R2#clear ip route * 


Zadanie B

2. Konfiguracji i w³¹czenie odpowiednich interfejsów - ró¿ne sieci bezpoœrednio pod³¹czone

3. 
Router(config)#ip routing

4.   
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.1  //192.168.1.1 - adres bramki
Router(config)#router eigrp 1234	
Router (config-if)#bandwidth 128   //mo¿na, nie trzeba
	//Rejestracja sieci bezpoœrednio pod³¹czonych:
Router(config-router)#network 200.200.100.0
Router(config-router)#network 200.200.200.0
	//Gdy nie ma wsparcia transmisji IP Multicast:
Router1(config-router)#neighbor 200.200.100.1 atm 0/0
Router2(config-router)#neighbor 200.200.100.2 atm 0/0    //atm 0/0 - interfejs

5.
ping lub traceroute
Router#sh ip eigrp topology
Router#sh ip eigrp topology all-links
Router#show ip eigrp topology 200.200.100.0
Router#sh ip eigrp neighbors
Router#sh ip eigrp traffic 
Router#debug ip routing
Router#show ip route
Router#show ip protocols
Router#debug ip routing 

6. w ruterze, w którym ruch bêdzie analizowany:
Router#debug eigrp fsm
Router#show ip eigrp topology all-links
	//Usu¹æ fizycznie jedno ³¹cze, obserwowaæ komunikaty dotycz¹ce FSM

7.
Router(config-router)#maximum-paths 4     //> 1, <= 16
Router#show ip protocols 
	//lub:
Router(config)#interface fa 0/0
Router(config-if)#ip load-sharing per-packet

Router#show ip eigrp topology
Router#show ip route eigrp

Router(config-router)#variance 3
Router#clear ip route eigrp 


Zadanie C

3.
Router(config)#int fa 0/0
Router (config-if)#no ip address
Router (config-if)#no shutdown
Router (config-if)#exit

4.
Router(config)#int fa 0/0.1
Router(config-subif)#encapsulation dot1Q 2
Router(config)#int fa 0/0.2
Router(config-subif)#encapsulation dot1Q 4   //2,4 - VLAN ID; fa0/0.1 - 1. pod-interfejs fa 0/0

5.
Router(config)#int fa 0/0.1
Router(config-if)#ip addr 10.1.0.1 255.255.0.0
Router(config)#int fa 0/0.2
Router(config-if)#ip addr 10.2.0.1 255.255.0.0   //Adresy OP zgodne z adresacj¹ poszczególnych VLAN

6. Powtórzyæ 4 i 5 dla kolejnych pod-interfejsów

7. Powtórzenie z zadañ A i B :/


Zadanie D

2.
R1(config)#interface fa 0/1.4
R1(config-subif)#encapsulation dot1Q 2
R1(config-subif)#ip address 11.0.0.1 255.255.255.0
R1(config-subif)#exit
R1(config)#interface fa /1.7
R1(config-subif)encapsulation dot1Q 4
R1(config-subif)ip address 13.0.0.1 255.255.255.0

R2(config)#interface fa 0/1.10
R2(config-subif)#encapsulation dot1Q 2
R2(config-subif)#ip address 11.0.0.2 255.255.255.0
R2(config-subif)#exit
R2(config)#interface fa /1.11
R2(config-subif)#encapsulation dot1Q 4
R2(config-subif)#ip address 13.0.0.2 255.255.255.0 

